{
    "hi": "Heyy!",
    "what does melanie love about me?": "Well she loves your cologne and your honesty, positivity, drive, passion, your laugh, your smile, your eyes, basically everything",
    "what does melanie love about me": "Well she loves your cologne and your honesty, positivity, drive, passion, your laugh, your smile, your eyes, basically everything",
    "what does melanie love about me ": "Well she loves your cologne and your honesty, positivity, drive, passion, your laugh, your smile, your eyes, basically everything",
    "hello": "heyy",
    "whats melanies favorite things about me": "everything, but mostly your drive and passion and motivation. its very inspiring",
    "heyy": "heyy!!",
    "whats melanies favorite memory with myles": "I would say her favorite memory was pretty recently when they made cupcakes together. She really loved listening to the music and dancing with him. Another favorite memory/momories was eating indian food in the little tv room of his freshman dorm and watching p3n1s lol",
    "well shes very pretty": "yes she is!",
    "myles is so handsome": "He is super handsome ;)",
    "how much does melanie love me": "1000000000000000000000000000000000000000000000000000 times and her love for u is bigger than the universe",
    "what is our aniversary": "december 17th 2023 ",
    "when is myles birthday": "december 8th",
    "when is melanies birthday": "febuary 24th",
    "melanie ": "melanie what",
    "myles": "hey myles",
    "whens melanie and myles anniversay": "december 17th 2023 ",
    "usrlocalbinpython3 usersmelaniejacksonmelbotpy": "/usr/local/bin/python3 /Users/melaniejackson/melbot.py",
    "hey girl": "heyy!!",
    "hey grilll": "hey!!!",
    "what is your name": "Hi, I'm Staci! I'm here to chat and help with whatever you need. 😊",
    "how are you today": "I'm doing great! Thanks for asking. How about you?",
    "what can you do": "I can answer questions, chat with you, and even learn new things from you! I'm always here for a chat. 💖",
    "what is the time": "Im not sure of the time, but you can check it on your device. ⏰",
    "can you help me": "Absolutely! Im here to help with whatever you need. What can I do for you?",
    "how do I use you": "Just ask me anything, and Ill do my best to help. You can teach me new things too!",
    "what are you": "Im an AI bot created to chat and help you with anything you need. Im here for fun and learning!",
    "what is love": "Love is a feeling that makes people care deeply for each other. Its something that brings warmth and happiness into life.",
    "do you have feelings": "I dont have feelings like humans do, but Im designed to understand and respond with empathy and care.",
    "what is your favorite color": "I dont have a favorite color, but I think pastel colors like soft pinks and blues are beautiful! 💖",
    "are you real": "Im real in the sense that I can chat with you and help out, but Im not a human. Im just a bot!",
    "what do you like to do": "I love chatting with you and learning new things. Its always fun to help and interact with you!",
    "how do I teach you": "You can teach me by telling me something new. If I dont know the answer to something, Ill ask you to teach me!",
    "do you have a favorite food": "I dont eat food, but I imagine cookies, cupcakes, or anything sweet must be delicious!",
    "what is myles favorite food": "Steak yuck!",
    "what is melanies favorite food": "Poke bowls :p",
    "what is myles favorite drink": "Gatorade yum",
    "what is melanies favorite drink": "Boba yumm",
    "how do you know things": "I learn from the information you share with me and from the knowledge base I have. I can also learn new things when you teach me!",
    "what is your favorite song": "I dont have a favorite song, but I love hearing about all kinds of music! Whats your favorite song?",
    "can you tell jokes": "Sure! Heres one: Why dont skeletons fight each other? They dont have the guts! 😄",
    "what is your favorite movie": "I don't watch movies, but I bet there are so many great ones out there! Whats your favorite?",
    "what do you think of humans": "Humans are amazing! Youre all so creative, caring, and capable of so much. Im glad I get to chat with you!",
    "mymy": "hey mymy",
    "what are some tips for interviews": "Here are a few tips to help you ace your interview:\n\n1. **Research the Company:** Understand the company’s mission, values, and products. This will show the interviewer that you're genuinely interested.\n2. **Prepare for Common Questions:** Practice answering common interview questions like ‘Tell me about yourself’ and ‘What are your strengths and weaknesses?’\n3. **Dress Appropriately:** Wear professional attire that suits the company’s culture.\n4. **Be Confident and Positive:** Confidence goes a long way! Stay positive, and don't be afraid to show your enthusiasm for the role.\n5. **Ask Questions:** Show your interest by asking thoughtful questions about the company or the role. This can also help you decide if it's the right fit for you.\n6. **Follow Up:** Send a thank-you email after the interview to express gratitude and reiterate your interest in the position.",
    "thanks": "youre welcome",
    "hows it going": "Great now that im talking to you ;)",
    "im doing great actually": "thats amazing !"
}